Heatsink-Optimization-Series/episode-05-optimization-loop/openfoam-template/constant/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiationModel  none;
