Heatsink-Optimization-Series/episode-05-optimization-loop/openfoam-template/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;
