Heatsink-Optimization-Series/episode-05-optimization-loop/openfoam-template/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p_rgh
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      1;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
        minIter         3;
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
        minIter         2;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        h               1e-4;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3;
        rho             0.5;
    }
    equations
    {
        U               0.5;
        h               0.5;
    }
}
